% Добавление аддитивного белого Гауссовского шума
%> @file AWGnoise.m
% =========================================================================
%> @brief Добавление аддитивного белого Гауссовского шума
%> @param signal входной сигнал
%> @param SNR отношение сигнал шум
%> @param nsamp колличество выборок на один символ сигнлала
%> @return nsignal зашумленный сигнал
%> @warning Обратите внимание на то, что сигнал представляется в комплексном виде,
% шум накладывается на I и Q компаненты. Мощность шума, как и мощность
% сигнала определяется суммарной мощностью I и Q компанент.
% =========================================================================
% Используйте генератор нормального распределения normrnd(mu,sigma,[размеры]),
% где mu – матожидание, sigma – стандартное отклонение.
% =========================================================================
function nsignal = AWGnoise (signal, SNR, nsamp)
%>todo Место для вашего кода
signalP = sum(signal .* conj(signal)) / length(signal);
noiseN0 = nsamp * signalP / (10^(SNR / 10));
averageAmplWhiteNoise = sqrt(noiseN0 / 2);
noise = averageAmplWhiteNoise * (normrnd(0, 1, size(signal)) + 1j * normrnd(0, 1, size(signal)));;
nsignal = signal + noise;
end
