% Домашнее задание №4. Канальное кодирование. Сверточный код: кодирование и декодирование
%> @file hw4_1.m
% =========================================================================
%> Подготовка рабочего места
% =========================================================================
    %> Отчистка workspace
    clear all;
    %> Закрытие рисунков
    close all;
    %> Отчистка Command Window
    clc;
% =========================================================================
%> Задание 1. Сверточный кодер со скоростью 1/2
% =========================================================================
% Проверка 1.1. Пример из лекции
% =========================================================================
    bits = [1, 0, 1, 0, 0, 1, 0, 0];
    codBits = ConvEcod(bits);
    check = [1, 1,   1, 0,   0, 0,   1, 0,   1, 1,   1, 1,   1, 0,   1, 1];
    ERR = Nerr (codBits, check)
    if ERR~= 0
        ERROR = "Проверьте кодер"
    else
        ans = "Проверка 1.1 пройдена успешно"
    end
% =========================================================================
% Проверка 1.2. Длинная последовательность.
% =========================================================================
    bits = [0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0,...
            0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0,...
            1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0,...
            0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1,...
            0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0];
    codBits = ConvEcod(bits);
    check =[0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,...
            1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0,...
            1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1,...
            1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0,...
            0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0,...
            1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0,...
            0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0,...
            1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,...
            0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0,...
            0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1];
    ERR = Nerr (codBits, check)
    if ERR~= 0
        ERROR = "Проверьте кодер"
    else
        ans = "Проверка 1.2 пройдена успешно"
    end
% =========================================================================
%> Задание 2. Декодер Витеби для светочного кода 1/2
% =========================================================================
% Проверка 2.1. Пример из лекции
% =========================================================================
    % Принято
    codBits = [0, 1,  0, 0,  1, 1,  0, 0,  0, 0,  0, 0,  0, 0];
    % Было отправлено
    send    = [1, 1,  1, 0,  1, 1,  0, 0,  0, 0,  0, 0,  0, 0];
    Bits = ConvDcod(codBits);
    check = [1, 0, 0, 0, 0, 0, 0];
    ERR = Nerr (Bits, check)
    if ERR~= 0
        ERROR = "Проверьте декодер"
    else
        ans = "Проверка 2.1 пройдена успешно"
    end
% =========================================================================
% Проверка 2.2. С кодом и без кода
% =========================================================================
    bits = randi([0 1], 1, 100000);
    codBits = ConvEcod(bits);
    modData = mapping(codBits, 2);
    SNR = 4;
    modData = AWGnoise (modData, SNR, 1);
    dmapBits = demapping (modData, 2, 0, SNR);
    ans = "Проверка 2.2 BER без кодирования"
    BER = (Nerr (codBits, dmapBits))/length(codBits)
    dBits = ConvDcod(codBits);
    ans = "Проверка 2.2 BER c кодированием"
    BER = (Nerr (bits, dBits))/length(bits)
    
    