% Домашняя работа 8_1. ФАПЧ
% 1. Рассчитать коэффициенты петлевого фильтра.
% 2. Написать ФАПЧ.
% 3. Посмотреть на точность (RMSE) и время установления ФАПЧ при шумах и
% различных параметрах фильтра (5-10 конфигураций + выводы). Прислать
% отденльным файлом

% =========================================================================
%> Remove items from MATLAB workspace and reset MuPAD engine
clear all;
%> Deletes all figures whose handles are not hidden
close all;
%> Clear Command Window
clc;
% =========================================================================
% Loop filter preset
% -------------------------------------------------------------------------
zeta = 0.2;           % detector gainDampingFactor
BnTs = 0.003;         % Normalized loop bandwidth (Ts считаем = 1)
Kd = 2 * pi;          % Phase (not change)
K0 = 1;               % not change
% =========================================================================
%> Loop filter coefficient calculation
% -------------------------------------------------------------------------
%todo прописать расчет коэффициентов фильтра
wp = BnTs / (zeta + 1 / (4 * zeta));
g1 = 2 - 2 * exp(- wp * zeta )* cos(wp * sqrt(1 - zeta ^ 2));
g2 = exp(-2 * wp * zeta) - 1 + g1;
%> Proportional coefficient
% Kp = 2 * zeta * wp  / (Kd * K0);
Kp = g1 / (Kd * K0);
%> Integrator coefficient
% Ki = wp ^ 2 / (Kd * K0);
Ki = g2 / ( Kd * K0);
% =========================================================================
% Imitate constant wave
% -------------------------------------------------------------------------
leng = 20000;
simb(1 : leng) = 1 * exp(1j * pi / 4);

% add noise
% todo прописать добавдление шума
SNR = 1;
simb_aw = AWGnoise (simb, SNR, 1);

% add freq shift
freq_offset_part = 0.2;
%> frequency offset <=> turn
simb = simb_aw .* exp(1j * (2 * pi * (1 : leng) * freq_offset_part));

% =========================================================================
% Main loop
% -------------------------------------------------------------------------
phase = 0;      % phase accumulation
prev = simb(1); % previous simb (for D&M)
nu_prev = 0;    % previous nu
e = 0;          % loop filter out
dfT = 0;        % Frequency shitf
dFT_arr = [];   %
e_prev = 0;

for i = 2:leng
    % =====================================================================
    % D&M detector
    % =====================================================================
    cur  = simb(i) * exp(1j * 2 * pi * phase); % current simb (for D&M)
    % todo D&M
    nu = imag(cur * conj(prev));
    prev = cur;
    % =====================================================================
    % Loop filder F(z)
    % =====================================================================
    e = Kp * nu + (Ki - Kp) * nu_prev + e_prev;
    e_prev = e;
    nu_prev = nu;
    % =====================================================================
    % Accumulation of frequency and phase
    % =====================================================================
    % Frequency shitf
    dfT = dfT - e;
    dFT_arr = [dFT_arr, -dfT];
    % Phase accumulation
    phase = mod(phase + dfT, 1);
end
figure
RMSE = sqrt(mean((dFT_arr - freq_offset_part) .^2));
plot (dFT_arr)
title("PLL: SNR = " + SNR + ", BnTs = " + BnTs + ", zeta = " + zeta + ", RMSE = " + RMSE);

% Вывод:
% 1) Время установки сокращается при большем BnTs, а также сокращается
% показатель среднеквадратичной ошибки. НО тут уточнение. По графику видно,
% что ошибка должна расти, однако расчеты ведуться с 1 отсчета, а время
% установления уменьшается. Если принять это во внимание, то время
% установки сокращается, а вот среднеквадратичная ошибка растет.
% 2) Уменьшение zeta ведет к большему размаху в колебаниях и, как
% следствие, к большему времени установления.
% 3) Ну и SNR увеличивает среднеквадратичную ошибку.
% P.S. Я не был на лекции в этом семестре, но, посмотрев запись за
% предыдущий, а также проанализировав презентацию, хочу сказать, что расчет
% коэффициентов Kp = 2 * zeta * wp  / (Kd * K0) & Ki = wp ^ 2 / (Kd * K0)
% неверен. Привожу сурс ( собсна сурс на основе которого презентация
% http://www.dsplib.ru/content/dpll/dpll.html ). Да, они прям не очень
% сильно отличаются (промоделировал), но все же.
